{"id":"3638459520","title":"Software Engineer (Full-Stack)","company":"Parrot","href":"https://www.linkedin.com/jobs/view/3638459520","location":"Miami, FL","description":"\n        <strong><u>About Us</u></strong><p><br></p>Parrot is an AI-first technology company empowering attorneys to get more from depositions. Trusted by leading insurance companies, law firms, and Fortune 500 companies alike, Parrot blends the proficiency of 100% reliable, highly-trained reporters with cutting-edge technology and artificial intelligence, ensuring smooth scheduling, immediate rough drafts, and real-time deposition summaries.<p><br></p>As a trusted partner for efficient court reporting services and its leading technology platform, Parrot enables its customers to unlock faster and better outcomes for their clients.<p><br></p>Why Join Us?<p><br></p>You'll build web applications and core backend services that integrate with state-of-the-art ASR and NLP models, solving interesting human-in-the-loop challenges that our 3-sided marketplace business model introduces. Your responsibilities will include end-to-end ownership of new features, maintaining existing systems, proactively improving the product, and bringing your own experience to achieve efficient engineering processes at scale. Responsibilities<p><br></p><ul><li>Be self-sufficient and take responsibility for seeing projects through all phases of the development life cycle</li><li>Participate in product decision-making, providing feedback and suggestions for improvement</li><li>Contribute to the codebase and ensure that it stays stable, readable, and fun to work on</li><li>Be ready to tackle all sorts of challenges ranging from building APIs, improving server infrastructure, or creating user interfaces and iterating on the design</li><li>Perform code reviews for your peers, provide constructive and actionable feedback</li><li>Ensure Parrot stays at the bleeding edge of modern web app development</li></ul>Requirements<p><br></p><ul><li>1+ years of professional software engineering experience, building and hosting software products from inception to release and maintenance</li><li>Enjoys working in a full-stack team, focusing on what it takes to solve the problems instead of focusing on certain technological areas</li><li>Thriving in a collaborative environment, efficient in remote setup</li><li>Able to work with people from operations or customer-facing roles to identify problems and build solutions</li><li>We use Python, React, Typescript, Kubernetes and AWS. We care about your engineering skills rather than specific language framework or tooling</li></ul><p><br></p><strong><u>Benefits</u></strong><p><br></p><strong>Equity.</strong> We value an owner's mentality - all our employees earn equity at Parrot!<strong>Hybrid, flexible work.</strong> The flexibility to work from home, with the opportunity to travel and work with your colleagues from our offices in select hubs.<strong>Health benefits.</strong> Highly competitive medical, dental and vision benefits for all full-time employees.Unlimited paid time off. We not only give you the opportunity to take the time off, but we also encourage you to do so. We want all our colleagues to enjoy time away from the grind.<strong>Parroteer Days.</strong> In addition to all public holidays, we provide four company-wide holidays annually. We do this to ensure our Team reflects on our successes and takes a moment for true time away.<strong>Parental leave. </strong>We offer two months of paid parental leave -- regardless of your status as a primary or secondary caregiver.<strong>Mental health.</strong> Annual subscription to meditation and mindfulness platform to help you focus on your mental health and happiness.<strong>Physical health.</strong> Access to fitness classes and facilities in your location through a company-wide membership program.<p><br></p><strong>We'd love to connect</strong><p><br></p>We are an equal-opportunity company and highly value diversity in our team. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, or disability status. If you're interested in what we're building, let's connect.<p><br></p>PI222278993\n      ","priority":350}