{"id":"3635190009","title":"Full Stack Engineer (React/Node.js)","company":"Thunkable","href":"https://www.linkedin.com/jobs/view/3635190009","location":"New York, NY","description":"\n        The Opportunity<p><br></p>You will add to, fix, and maintain features of our product by working on our React based front end, our Node/Express based back end, and our React Native based mobile components.<p><br></p>We’re Looking For Someone Who Has<p><br></p><ul><li> You enjoy making hard things look easy to usersYou like to write clean, well abstracted code</li><li> You have strong communication skills, a positive attitude, and empathy</li><li> You are experienced in as many of the following as possible: JavaScript, React, ExpressJS, GraphQL, Node, React Native, Expo, Kubernetes, iOS/Swift, Android/Kotlin</li><li> You might not be experienced in all of these technologies, but you are still awesome and should join our team<br></li></ul><p><br></p>Bonus:<p><br></p><ul><li> You created a working app on Thunkable</li><li> You have a passion for well designed experiences and good UX</li><li> You have experience and interest in QA/Testing</li><li> You have experience in small start­up environments<br></li></ul><p><br></p>Life at Thunkable<p><br></p>Thunkable is on a mission to democratize app development and empower everyone to build without writing a single line of code. Our platform enables anyone to build and publish their iOS and Android apps for free. Today, non-engineers use Thunkable to prototype and share new ideas, develop proofs-of-concept for their own digital business, and design and ship their own ad-supported and premium apps. Thunkable was incubated at Google Research and MIT.<p><br></p>We are backed by Lightspeed, NEA, Owl Ventures, SV Angel, Zhenfund, and Y-Combinator. Our founders are MIT engineers who want to extend the power and fun of creation to people who don’t code.<p><br></p>Joining Thunkable means joining a team of passionate, entrepreneurial and friendly people with different backgrounds, shared ideas, and similar goals.<p><br></p>What will you get when joining our team?<p><br></p><ul><li> Get compensated: We offer competitive pay, equity and benefits to our employees based on their location. You’ll get access to unlimited PTO regardless of your location</li><li> Wellness and Training Budget: We value your well-being and want to invest in it</li><li> Work Where You Want: The company is based in San Francisco (with an office), but operates globally, with team members working across a number of cities, countries, and time zones (to facilitate async work we prioritize countries and locations in a max 2h time zone difference from those hubs: San Francisco, New York and Dublin)</li><li> Shared values: Creativity, Openness, Transparency, Persistence, and Entrepreneurialism</li><li> Challenge yourself by acquiring new abilities, interacting with clients, enhancing products, or learning design. We will encourage you to reach your full potential<br></li></ul><p><br></p>We believe that a diverse and inclusive workplace helps ensure we learn from each other’s different backgrounds, experiences, and perspectives and is critical for building a product that supports the wide range of our users’ needs. Thunkable is an equal opportunity employer and a pleasant and supportive place to work. Women, minorities, individuals with disabilities and protected veterans are encouraged to apply.<p><br></p>This position offers a competitive salary that is based on a combination of factors including location. The salary range for this role in San Francisco is between $80,000 and $150,000 per year and will be based on qualifications and skills. If the successful candidate is located in a different location or country, the salary may vary based on the cost of living, currency and other local factors. We are open to discussing salary with candidates who are interested in the role and may be willing to negotiate based on the candidate's experience and qualifications. We are committed to paying our employees fairly and providing opportunities for professional growth and development.\n      ","priority":750}