{"id":"3635192837","title":"Frontend Developer","company":"Path Integral Technology, Inc.","href":"https://www.linkedin.com/jobs/view/3635192837","location":"Mountain View, CA","description":"\n        <p>We are an early stage AI startup looking for an experienced Frontend Developer who will play a key role in building our web applications using React.js. The successful candidate will work alongside our product team to design, develop, and deploy modern, responsive web interfaces that will be used by our rapidly growing customer base.</p><p><br></p><p>Responsibilities:</p><p>- Design and develop web applications using React.js</p><p>- Collaborate with product team to understand user needs, UI/UX requirements, and to develop new features</p><p>- Implement responsive design to ensure application compatibility across multiple devices and platforms</p><p>- Write clean, modular, well-documented, and maintainable code</p><p>- Conduct code reviews and contribute to codebase improvements</p><p>- Participate in team meetings and contribute to technical discussions</p><p>- Continuously learn and integrate emerging trends, frameworks, libraries, and tools.</p><p><br></p><p>Requirements:</p><p>- Bachelor's degree in Computer Science or related field</p><p>- Minimum of 4 years of industry experience in frontend development</p><p>- Experience in developing web applications using React.js, Redux, HTML, CSS, and JavaScript</p><p>- Strong foundation in frontend development principles, such as responsive design, web optimization, and cross-browser compatibility</p><p>- Knowledge of RESTful APIs and web application security</p><p>- Excellent communication and collaboration skills</p><p>- A passion for software development and a desire to work in a fast-paced startup environment.</p><p><br></p><p>Benefits:</p><p>- Competitive salary and equity&nbsp;</p><p>- Flexible work hours and work from home options</p><p>- Personal and professional growth opportunities</p><p>- A supportive and inclusive work culture that values diversity and teamwork.</p><p><br></p><p>Join our dynamic and innovative team, and contribute to developing cutting-edge AI applications that solve real-world problems!</p>\n      ","priority":500}