{"id":"3640161780","title":"Full Stack Developer","company":"FreightPlus","href":"https://www.linkedin.com/jobs/view/3640161780","location":"Quincy, MA","description":"\n        FreightPlus is an industry provider of data-driven transportation management, offering businesses customized and fully tailored managed transportation solutions in a boutique environment where clients get the individual attention they deserve. FreightPlus combines first class customer service with innovative technology and industry best practices to help mid-size and growing companies work efficiently in the $800B domestic transportation market. The Company is ranked #184 in the most recent Inc. 5000 list of fastest growing companies. Visit FreightPlus.io for more information.<p><br></p><strong>Location: Quincy, MA</strong><p><br></p>FreightPlus is seeking a Full Stack Developer to join our team. Our Software Engineer will be proficient in both front and back-end code development. This role requires a significant set of technical skills, including a deep knowledge of database design and multiple programming languages. Communication skills are critical when working with various departments across the organization.<p><br></p><strong>Responsibilities</strong><p><br></p>The Full Stack Developer is responsible for:<p><br></p><ul><li>Managing the complete software development process from conception to deployment</li><li>Maintaining and upgrading the software following deployment</li><li>Managing the end-to-end life cycle for the production of software and applications</li><li>Overseeing and guiding the analyzing, writing, building, and deployment of software</li><li>Overseeing the automated testing and providing feedback to management during the development process</li><li>Modifying and testing changes to previously developed program</li><li>Developing front end website architecture</li><li>Designing user interactions on web pages</li><li>Developing back-end website applications</li><li>Creating application servers and databases for functionality</li><li>Ensuring cross-platform optimization for mobile applications</li><li>Ensuring responsiveness of applications</li><li>Seeing through a project from conception to finished product</li><li>Designing and developing APIs</li><li>Aligning technical design and function with business requirements</li><li>Staying abreast of developments in web applications and programming languages</li></ul><p><br></p><strong>Requirements</strong><p><br></p><ul><li>For this role we are looking for a Generalist.</li><ul><li>Generalist: Generalists are typically found on small teams or in small companies. In this setting, data engineers wear many hats as one of the few “data-focused” people in the company. Generalists are often responsible for every step of the data process, from managing data to analyzing it. This is a good role for anyone looking to transition from data science to data engineering, since smaller businesses won’t need to worry as much about engineering “for scale.”</li><li>Pipeline-centric: Often found in midsize companies, pipeline-centric data engineers work alongside data scientists to help make use of the data they collect. Pipeline-centric data engineers need “in-depth knowledge of distributed systems and computer science,” according to Dataquest.</li><li>Database-centric: In larger organizations, where managing the flow of data is a full-time job, data engineers focus on analytics databases. Database-centric data engineers work with data warehouses across multiple databases and are responsible for developing table schemas.</li></ul></ul><p><br></p>Characteristics we expectOur Software Engineers will lead by example. Software Engineers must therefore possess and express all the qualities we expect in our developers, including curiosity, passion, self-accountability, and diligence. In addition, owning a project’s execution will require them to be organized, disciplined, and autonomous; leading a team will require them to be patient, excellent verbal and written communicators, and able to move fluidly between macro and micro concerns.<p><br></p>Helpful Skill Sets &amp; Experience<p><br></p><ul><li>Fundamental understanding of:</li><li>Front-end languages such as HTML, CSS, and JavaScript</li><li>JavaScript frameworks such as React, Angular JS, and Amber</li><li>Server-side languages such as Node.js, Python, and .Net</li><li>Database technology such as MySQL, Oracle, and MongoDB</li><li>Utilizing REST API and GraphQL</li><li>Architecting SOA applications</li><li>Writing user stories</li><li>Collaborating with internal / external engineering teams</li><li>Working with version control systems like Git, CodeCommit, Azure DevOps</li></ul>Certifications (Preferred)<p><br></p><ul><li>Cloudera Certified Professional (CCP): Data Engineer</li><li>Google Cloud Certified Professional Data Engineer</li><li>Certificate in Engineering Excellence Big Data Analytics Optimization (CPEE)</li><li>IBM Certified Data Engineer – Big Data</li><li>Amazon Data Engineer Certification</li></ul><p><br></p><strong>Benefits</strong><p><br></p>The compensation package includes a competitive salary, performance bonuses, health, dental, disability and 401k benefits, and unlimited vacation.\n      ","priority":950}